app/controllers/charities_controller.rb

  def index
    @charities = Organization.where(orgtype: 'charity')
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."orgtype" = $1  [["orgtype", "charity"]]